9/data/attachments/3d5e2f213af29f24.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b8a33106-67bf-4912-84c1-bc40c6913898</nif:username>
            <nif:friendToBeAdded>Grace_American_Friend_17088_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>